angular.module('wordInAWord')

  .factory('Data', function (DB) {
    return {
      firstDataUpdate: function () {
        var newComposingWords = "('омар', 58), ('волос', 78), ('лати', 16), ('лати', 51), ('абак', 5), ('абак', 20), ('абак', 38), ('саке', 17), ('саке', 60), ('саке', 71), ('саке', 100)",
          composingWordsIdsToDelete = [114, 2406, 2504, 3601, 4030],
          newWordsDescriptions = "('волос', '1. Те саме, що волосина 2. Те саме, що волосся 3. Шерсть тварин, а також волосини з гриви та хвоста коней; використовується для різних виробів і технічних потреб 4. Волокна деяких тропічних і субтропічних рослин 5. Опух з наривом під нігтем пальця 6. Тонкий, як волосинка, водяний черв’як'), " +
            "('лати', 'Металеве спорядження стародавнього воїна, яке захищало від холодної, а пізніше і від вогнепальної зброї'), " +
            "('абак', 'Те саме, що абака (1. Плита (звичайно квадратна), що становить верхню частину капітелі колони 2. Лічильна дошка у давніх греків та римлян)'), " +
            "('саке', 'Японська рисова горілка')",
          word1 = 'арак',
          word1NewDescription = 'Поширений на сході міцний спиртний напій, що виготовляється із соку пальми, рису, ячменю, пшениці та ін.',
          word2 = 'арат',
          word2NewDescription = 'У Монголії – селянин, що займається кочовим тваринництвом';

        DB.insertComposingWords(newComposingWords).then(function () {
          DB.deleteComposingWordsByIds(composingWordsIdsToDelete).then(function () {
            DB.insertWordsDescriptions(newWordsDescriptions).then(function () {
              DB.updateWordDescription(word1, word1NewDescription).then(function () {
                DB.updateWordDescription(word2, word2NewDescription).then(function () {
                }, function (err) {
                  console.error(err);
                });
              }, function (err) {
                console.error(err);
              });
            }, function (err) {
              console.error(err);
            });
          }, function (err) {
            console.error(err);
          });
        }, function (err) {
          console.error(err);
        });
      },
      secondDataUpdate: function () {
        var newComposingWords = "('саке', 95), ('дан', 13), ('дан', 26), ('дан', 36), ('твід', 14), ('біт', 5), ('біт', 14), ('біт', 85), ('біт', 90), ('біт', 95), ('ара', 9), ('ара', 19), ('ара', 23), ('ара', 25), ('ара', 26), ('ара', 32), ('ара', 40), ('ара', 49), ('ара', 56), ('ара', 59), ('ара', 68), ('ара', 72), ('ара', 76), ('ара', 92), ('ара', 97), ('ара', 98)",
          newWordsDescriptions = "('твід', 'Шерстяна тканина полотняного переплетення для верхнього одягу'), " +
            "('біт', '1. Мінімальна одиниця виміру кількості інформації та об’єму пам’яті комп’ютера (дорівнює одній комірці або одному двійковому знаку типу «так-ні») 2. Одиниця ємності пам’яті, яка відповідає одному двійковому розряду 3. Чіткий ритм в музиці || Ритм (про роботу серця) 4. Те саме, що біт-музика'), " +
            "('ара', 'Група довгохвостих папуг')";

        DB.insertComposingWords(newComposingWords).then(function () {
          DB.insertWordsDescriptions(newWordsDescriptions).then(function () {
            DB.updateComposingWordName('тетрарх ', 'тетрарх').then(function () {
              DB.updateNameInWordDescription('тетрарх ', 'тетрарх').then(function () {
              }, function (err) {
                console.error(err);
              });
            }, function (err) {
              console.error(err);
            });
          }, function (err) {
            console.error(err);
          });
        }, function (err) {
          console.error(err);
        });
      },
      thirdDataUpdate: function () {
        var newComposingWords = "('аск', 17), ('аск', 20), ('аск', 31), ('аск', 46), ('аск', 50), ('аск', 60), ('аск', 66), ('аск', 71), ('аск', 75), ('аск', 81), ('аск', 84), ('аск', 95), ('аск', 100), " +
          "('бут', 14), ('бут', 61), ('бут', 90), " +
          "('дож', 47), " +
          "('дук', 28), ('дук', 38), ('дук', 47), ('дук', 89), " +
          "('его', 35), ('его', 65), " +
          "('еон', 2), ('еон', 35), ('еон', 44), ('еон', 45), ('еон', 91), ('еон', 96), " +
          "('ере', 7), ('ере', 11), ('ере', 18), ('ере', 53), ('ере', 65), " +
          "('ефа', 12), ('ефа', 45), " +
          "('ехо', 15), ('ехо', 60), " +
          "('кеб', 38), ('кеб', 63), ('кеб', 70), ('кеб', 85), ('кеб', 95), ('кеб', 100), " +
          "('кед', 28), ('кед', 38), ('кед', 73), " +
          "('лек', 10), ('лек', 11), ('лек', 17), ('лек', 53), ('лек', 55), ('лек', 63), ('лек', 64), ('лек', 65), ('лек', 71), ('лек', 85), ('лек', 95), ('лек', 100), " +
          "('орк', 3), ('орк', 15), ('орк', 23), ('орк', 28), ('орк', 41), ('орк', 44), ('орк', 60), ('орк', 63), ('орк', 65), ('орк', 69), ('орк', 73), ('орк', 80), ('орк', 85), ('орк', 87), ('орк', 96), ('орк', 97), ('орк', 100), " +
          "('пер', 45), ('пер', 52), ('пер', 65), ('пер', 91), " +
          "('пук', 29), ('пук', 33), ('пук', 50), " +
          "('пут', 29), ('пут', 33), ('пут', 50), ('пут', 90), " +
          "('раз', 40), ('раз', 53), ('раз', 89), ('раз', 92), ('раз', 93), " +
          "('реп', 45), ('реп', 52), ('реп', 65), ('реп', 91), " +
          "('тен', 34), ('тен', 35), ('тен', 40), ('тен', 44), ('тен', 45), ('тен', 55), ('тен', 91), ('тен', 96), " +
          "('ток', 15), ('ток', 23), ('ток', 30), ('ток', 31), ('ток', 41), ('ток', 44), ('ток', 62), ('ток', 65), ('ток', 75), ('ток', 78), ('ток', 81), ('ток', 85), ('ток', 95), ('ток', 96), ('ток', 97), ('ток', 100), " +
          "('фрі', 45), ('фрі', 48), ('фрі', 58), ('фрі', 64), ('фрі', 93), " +
          "('яга', 48), " +
          "('абаз', 38), " +
          "('ажан', 9), " +
          "('азан', 38), ('азан', 40), " +
          "('акне', 1), ('акне', 38), ('акне', 55), ('акне', 96), " +
          "('алан', 13), ('алан', 34), ('алан', 51), ('алан', 55), " +
          "('амід', 26), ('амід', 94), " +
          "('анти', 5), ('анти', 40), ('анти', 49), ('анти', 51), " +
          "('арго', 6), ('арго', 27), ('арго', 48), ('арго', 54), ('арго', 59), ('арго', 77), ('арго', 88), " +
          "('аура', 19), ('аура', 25), ('аура', 56), ('аура', 98), " +
          "('барк', 3), ('барк', 63), ('барк', 80), ('барк', 85), ('барк', 87), ('барк', 100), " +
          "('бета', 85), ('бета', 95), ('бета', 100), " +
          "('біом', 90), " +
          "('блік', 85), ('блік', 87), ('блік', 95), " +
          "('буна', 38), ('буна', 80), ('буна', 90), " +
          "('ваба', 5), ('ваба', 20), " +
          "('віно', 3), ('віно', 14), ('віно', 35), ('віно', 39), " +
          "('вкіс', 66), ('вкіс', 70), ('вкіс', 84), " +
          "('воло', 78), " +
          "('вона', 3), ('вона', 31), ('вона', 35), ('вона', 39), ('вона', 69), ('вона', 75), ('вона', 81), ('вона', 88), " +
          "('ворс', 28), " +
          "('гало', 67), " +
          "('гета', 35), " +
          "('гофр', 48), " +
          "('грат', 43), ('грат', 48), ('грат', 54), ('грат', 98), " +
          "('дані', 26), " +
          "('деко', 28), ('деко', 73), " +
          "('дзен', 38), " +
          "('діва', 26), ('діва', 84), " +
          "('донг', 88), " +
          "('дорн', 8), ('дорн', 36), ('дорн', 88), " +
          "('дрон', 8), ('дрон', 36), ('дрон', 88), " +
          "('есер', 11), ('есер', 18), " +
          "('етер', 18), ('етер', 65), " +
          "('ехін', 55), " +
          "('жако', 69), " +
          "('злет', 18), " +
          "('ідея', 42), ('ідея', 73), " +
          "('ікло', 39), ('ікло', 65), ('ікло', 85), ('ікло', 87), ('ікло', 95), " +
          "('імла', 67), ('імла', 94), " +
          "('інія', 58), ('інія', 83), " +
          "('інок', 3), ('інок', 39), ('інок', 96), " +
          "('ірит', 37), ('ірит', 43), " +
          "('капа', 75), " +
          "('квак', 20), ('квак', 30), " +
          "('кепі', 10), ('кепі', 65), " +
          "('кілт', 10), ('кілт', 55), ('кілт', 56), ('кілт', 65), ('кілт', 66), ('кілт', 85), ('кілт', 93), ('кілт', 95), " +
          "('крап', 50), " +
          "('крор', 15), " +
          "('куна', 1), ('куна', 38), ('куна', 80), " +
          "('курд', 28), ('курд', 89), " +
          "('лобі', 85), ('лобі', 87), ('лобі', 95), " +
          "('лови', 78), " +
          "('лорі', 65), ('лорі', 85), ('лорі', 87), " +
          "('лояк', 39), " +
          "('луск', 50), " +
          "('ляск', 11), " +
          "('маго', 35), ('маго', 59), ('маго', 67), " +
          "('мапа', 59), ('мапа', 94), " +
          "('мате', 35), ('мате', 40), " +
          "('мило', 62), " +
          "('миро', 8), ('миро', 22), ('миро', 41), " +
          "('морф', 58), " +
          "('нава', 4), ('нава', 5), ('нава', 26), ('нава', 75), ('нава', 81), " +
          "('наос', 31), ('наос', 35), ('наос', 54), ('наос', 75), ('наос', 81), " +
          "('окап', 75), ('окап', 82), " +
          "('окіл', 39), ('окіл', 65), ('окіл', 85), ('окіл', 87), ('окіл', 95), " +
          "('окур', 28), ('окур', 80), " +
          "('опал', 16), ('опал', 51), ('опал', 52), ('опал', 94), " +
          "('опит', 16), ('опит', 41), ('опит', 51), " +
          "('орар', 15), ('орар', 59), ('орар', 74), " +
          "('охра', 15), ('охра', 60), " +
          "('пава', 75), " +
          "('панк', 75), " +
          "('парі', 45), ('парі', 90), " +
          "('песо', 91), " +
          "('піта', 10), ('піта', 29), ('піта', 45), ('піта', 90), " +
          "('поза', 82), " +
          "('птоз', 41), " +
          "('рака', 9), ('рака', 23), ('рака', 25), ('рака', 26), ('рака', 32), ('рака', 49), ('рака', 56), ('рака', 68), ('рака', 72), ('рака', 92), ('рака', 97), " +
          "('ралі', 56), ('ралі', 85), ('ралі', 87), ('ралі', 93), " +
          "('регі', 65), " +
          "('сван', 31), ('сван', 35), ('сван', 75), ('сван', 81), " +
          "('сіда', 84), " +
          "('соня', 81), " +
          "('спин', 33), ('спин', 86), " +
          "('стук', 33), ('стук', 50), " +
          "('сура', 24), ('сура', 50), " +
          "('твін', 5), ('твін', 14), ('твін', 35), " +
          "('тлін', 55), " +
          "('трус', 18), ('трус', 24), ('трус', 50), ('трус', 61), " +
          "('улан', 80), " +
          "('упин', 33), " +
          "('фогт', 48), " +
          "('хора', 15), ('хора', 60), " +
          "('абрек', 63), ('абрек', 85), ('абрек', 100), " +
          "('агора', 59), " +
          "('аерон', 45), ('аерон', 96), " +
          "('аксон', 31), ('аксон', 75), ('аксон', 81), " +
          "('актин', 5), ('актин', 49), " +
          "('антре', 40), ('антре', 45), ('антре', 96), " +
          "('апекс', 71), " +
          "('аспід', 84), " +
          "('астат', 81), " +
          "('атман', 40), " +
          "('ацтек', 55), " +
          "('бадан', 38), " +
          "('бакир', 80), " +
          "('басет', 95), ('басет', 100), " +
          "('бівак', 3), ('бівак', 5), " +
          "('біонт', 14), ('біонт', 90), " +
          "('бурат', 90), " +
          "('вагри', 88), " +
          "('валін', 39), " +
          "('варна', 26), " +
          "('ватин', 5), " +
          "('винар', 88), " +
          "('вируб', 70), " +
          "('волан', 39), " +
          "('волот', 78), " +
          "('вояка', 39), ('вояка', 81), " +
          "('втома', 31), ('втома', 35), " +
          "('гавіт', 35), " +
          "('геном', 35), " +
          "('гімен', 35), " +
          "('горно', 6), ('горно', 54), " +
          "('грант', 54), " +
          "('данка', 9), ('данка', 13), ('данка', 26), ('данка', 38), ('данка', 68), " +
          "('дартс', 76), " +
          "('десть', 79), " +
          "('дожин', 47), " +
          "('донка', 13), " +
          "('дрель', 79), " +
          "('еклер', 11), ('еклер', 53), ('еклер', 65), " +
          "('енець', 55), " +
          "('ерато', 15), ('ерато', 45), ('ерато', 85), ('ерато', 96), ('ерато', 100), " +
          "('етнос', 35), ('етнос', 91), " +
          "('жакан', 9), " +
          "('жовно', 69), " +
          "('зарин', 40), " +
          "('імаго', 35), ('імаго', 67), " +
          "('ірмос', 60), " +
          "('казан', 38), " +
          "('каліф', 93), " +
          "('карел', 53), ('карел', 63), ('карел', 85), ('карел', 100), " +
          "('карія', 73), " +
          "('карма', 25), ('карма', 26), ('карма', 68), " +
          "('кілер', 64), ('кілер', 65), ('кілер', 85), " +
          "('коата', 23), ('коата', 30), ('коата', 75), ('коата', 81), ('коата', 97), " +
          "('ковар', 3), ('ковар', 69), " +
          "('кодек', 28), " +
          "('кодер', 28), ('кодер', 73), " +
          "('котер', 15), ('котер', 44), ('котер', 65), ('котер', 85), ('котер', 96), ('котер', 100), " +
          "('котик', 30), " +
          "('крота', 15), ('крота', 23), ('крота', 85), ('крота', 96), ('крота', 97), ('крота', 100), " +
          "('крупа', 50), " +
          "('лівак', 10), ('лівак', 39), ('лівак', 56), ('лівак', 66), ('лівак', 99), " +
          "('ліпід', 94), " +
          "('лопар', 52), " +
          "('лотік', 65), ('лотік', 85), ('лотік', 95), " +
          "('манат', 40), " +
          "('манко', 31), " +
          "('манта', 40), " +
          "('манту', 90), " +
          "('марани', 40), ('марани', 68), " +
          "('матір', 24), ('матір', 83), ('матір', 90), " +
          "('митар', 40), " +
          "('місто', 35), " +
          "('моція', 58), " +
          "('надир', 8), ('надир', 68), ('надир', 88), " +
          "('накра', 9), ('накра', 26), ('накра', 49), ('накра', 68), ('накра', 72), " +
          "('нанка', 68), " +
          "('нарди', 8), ('нарди', 68), ('нарди', 88), " +
          "('нарти', 40), ('нарти', 49), " +
          "('натік', 5), ('натік', 55), ('натік', 96), " +
          "('нерка', 1), ('нерка', 96), " +
          "('нурта', 90), " +
          "('овіна', 3), ('овіна', 35), ('овіна', 39), " +
          "('октет', 15), ('октет', 95), ('октет', 96), " +
          "('орнат', 36), ('орнат', 45), ('орнат', 54), ('орнат', 90), ('орнат', 96), " +
          "('осман', 31), ('осман', 35), " +
          "('отоса', 31), ('отоса', 54),('отоса', 75),('отоса', 81), " +
          "('падло', 16), ('падло', 52), ('падло', 94), " +
          "('парео', 45), ('парео', 52), " +
          "('патіо', 45), ('патіо', 90), " +
          "('перко', 65), " +
          "('пірке', 65), " +
          "('плеск', 71), " +
          "('помір', 90), " +
          "('помор', 41), " +
          "('рекет', 65), " +
          "('ретро', 15), " +
          "('робак', 3), ('робак', 63), ('робак', 80), ('робак', 85), ('робак', 87), ('робак', 100), " +
          "('родео', 28), " +
          "('ротсе', 61), ('ротсе', 91), ('ротсе', 100), " +
          "('русин', 70), " +
          "('саміт', 24), ('саміт', 35), ('саміт', 83), " +
          "('сапка', 75), " +
          "('свінг', 35), " +
          "('серин', 70), " +
          "('сонар', 54), " +
          "('стала', 66), " +
          "('табес', 95), ('табес', 100), " +
          "('таліб', 85), ('таліб', 95), " +
          "('танка', 5), ('танка', 49), ('танка', 55), ('танка', 72), ('танка', 75), ('танка', 81), " +
          "('тарко', 15), ('тарко', 23), ('тарко', 85), ('тарко', 96), ('тарко', 97), ('тарко', 100), " +
          "('тепло', 65), " +
          "('тикар', 49), " +
          "('тимар', 40), " +
          "('тіпун', 90), " +
          "('толос', 78), " +
          "('тонер', 44), ('тонер', 45), ('тонер', 91), ('тонер', 96), " +
          "('траст', 43), " +
          "('трона', 36), ('трона', 45), ('трона', 54), ('трона', 90), ('трона', 96), " +
          "('турка', 25), ('турка', 50), ('турка', 56), ('турка', 93), " +
          "('хазар', 40), " +
          "('хакер', 15), ('хакер', 60), " +
          "('цурка', 1), " +
          "('амідол', 94), " +
          "('аронія', 58), " +
          "('афонія', 58), " +
          "('біоцид', 14), " +
          "('борніт', 90), " +
          "('бревіс', 70), " +
          "('брунат', 90), " +
          "('відтин', 14), " +
          "('вістка', 66), " +
          "('віянка', 39), " +
          "('гарсон', 54), " +
          "('гліома', 67), " +
          "('голіаф', 67), " +
          "('діарея', 73), " +
          "('істота', 95), " +
          "('кантрі', 96), " +
          "('канцер', 1), " +
          "('карнет', 96), " +
          "('клуатр', 25), ('клуатр', 50), ('клуатр', 56), ('клуатр', 93), " +
          "('костел', 95), ('костел', 100), " +
          "('кратон', 96), " +
          "('ланіта', 55), " +
          "('листок', 78), " +
          "('лобіст', 95), " +
          "('макрос', 60), " +
          "('мантра', 40), " +
          "('марита', 40), " +
          "('мартин', 40), " +
          "('надрив', 88), " +
          "('наклад', 13), " +
          "('нестор', 91), " +
          "('океніт', 96), " +
          "('оладка', 13), " +
          "('оперон', 45), " +
          "('оптрон', 45), " +
          "('плотер', 65), " +
          "('понтер', 45), ('понтер', 91), " +
          "('постер', 91), " +
          "('протік', 65), " +
          "('ратник', 49), " +
          "('ремікс', 60), " +
          "('саронг', 54), " +
          "('сванка', 75), ('сванка', 81), " +
          "('свитка', 46), " +
          "('смоква', 31), " +
          "('ставок', 31), ('ставок', 75), ('ставок', 81), " +
          "('таксон', 31), ('таксон', 75), ('таксон', 81), " +
          "('танбур', 90), " +
          "('тантра', 72), " +
          "('текіла', 10), ('текіла', 55), ('текіла', 85), ('текіла', 95), " +
          "('тіофен', 45), " +
          "('токата', 81), " +
          "('тоніка', 96), " +
          "('трафік', 93), " +
          "('тропан', 45), ('тропан', 90), " +
          "('автонім', 35), " +
          "('акреція', 73), " +
          "('антиква', 5), " +
          "('батоліт', 95), " +
          "('білотка', 85), ('білотка', 95), " +
          "('біотест', 95), " +
          "('китолов', 78), " +
          "('кластер', 100), " +
          "('манірка', 26), " +
          "('мінорат', 90), " +
          "('невтома', 35), " +
          "('пароніт', 45), ('пароніт', 90), " +
          "('селіток', 95), " +
          "('сентаво', 35), " +
          "('стакато', 81), " +
          "('харизма', 40), " +
          "('манок', 31), " +
          "('кола', 13), ('кола', 21), ('кола', 23), ('кола', 39), ('кола', 63), ('кола', 80), ('кола', 85), ('кола', 87), ('кола', 95), ('кола', 100), " +
          "('базука', 38), " +
          "('крек', 28), " +
          "('бод', 14), " +
          "('азу', 38), ('азу', 89), ('азу', 93), " +
          "('бат', 5), ('бат', 85), ('бат', 90), ('бат', 95), ('бат', 100), " +
          "('кіп', 10), ('кіп', 29), ('кіп', 65), ('кіп', 84), ('кіп', 99), " +
          "('чон', 2), " +
          "('вату', 29), ('вату', 56), " +
          "('драм', 8), ('драм', 26), ('драм', 68), ('драм', 98), " +
          "('кіна', 3), ('кіна', 5), ('кіна', 26), ('кіна', 39), ('кіна', 55), ('кіна', 96), " +
          "('кляр', 11), " +
          "('ларі', 56), ('ларі', 85), ('ларі', 87), ('ларі', 93), " +
          "('лате', 10), ('лате', 34), ('лате', 55), ('лате', 71), ('лате', 85), ('лате', 95), ('лате', 100), " +
          "('лоті', 65), ('лоті', 85), ('лоті', 95), " +
          "('пула', 50), " +
          "('ріал', 56), ('ріал', 85), ('ріал', 87), ('ріал', 93), " +
          "('табі', 5), ('табі', 85), ('табі', 90), ('табі', 95), " +
          "('така', 5), ('така', 23), ('така', 25), ('така', 30), ('така', 32), ('така', 46), ('така', 49), ('така', 55), ('така', 56), ('така', 66), ('така', 72), ('така', 75), ('така', 81), ('така', 97), " +
          "('тала', 23), ('тала', 25), ('тала', 34), ('тала', 51), ('тала', 55), ('тала', 56), ('тала', 66), " +
          "('віна', 3), ('віна', 5), ('віна', 26), ('віна', 35), ('віна', 39), " +
          "('епод', 52), " +
          "('каді', 26), ('каді', 73), ('каді', 84), " +
          "('своп', 75), " +
          "('тетрі', 15), ('тетрі', 96), " +
          "('тіні', 83), " +
          "('аніме', 35), " +
          "('долма', 94), " +
          "('панти', 51), " +
          "('карибу', 80), " +
          "('мартіні', 83), " +
          "('тороки', 41), " +
          "('нетто', 96), " +
          "('ксерокс', 28), " +
          "('піар', 45), ('піар', 90), " +
          "('мураха', 25), " +
          "('теракт', 15), ('теракт', 96), " +
          "('злак', 53), ('злак', 93)",
          newWordsDescriptions = "('аск', 'Орган статевого спороносіння сумчатих грибів, усередині якого розвиваються аскоспори'), " +
            "('бут', '1. Будівельний камінь, що використовується головним чином для фундаменту 2. За часів набігів ординців на Україну – бранець, силоміць навернений у мусульманство'), " +
            "('дож', 'Глава держави у Венеціанській (7-18 ст.) і Генуезькій (14-18 ст.) республіках'), " +
            "('дук', 'Цупка тканина типу парусини, що використовується для виготовлення палітурок'), " +
            "('его', 'За теорією психоаналізу, та частина людської особистості, яка усвідомлюється як власне «Я» і знаходиться в контакті з навколишнім світом за допомогою сприйняття'), " +
            "('еон', '1. У міфологічних уявленнях пізньоантичного язичництва – персоніфікація часу (під впливом іранської міфології) 2. Найбільший підрозділ геологічної історії Землі, що об’єднує кілька ер'), " +
            "('ере', 'Розмінна монета датської крони, норвезької крони, шведської крони – 1/100 крони'), " +
            "('ефа', 'Змія родини гадюкових'), " +
            "('ехо', '1. У давньогрецькій міфології – німфа, покарана Герою за надмірну балакучість тим, що втратила здатність говорити і лише повторювала закінчення чужих слів 2. Те саме, що луна 3. Художній прийом, що полягає в повторюванні звука, співзвуччя або музичної фрази з меншою силою звучання'), " +
            "('кеб', '1. Візницький однокінний екіпаж в Англії 2. Назва таксі в Лондоні'), " +
            "('кед', 'Легке спортивне взуття на гумовій підошві (однина)'), " +
            "('лек', 'Грошова одиниця Албанії'), " +
            "('орк', 'Войовнича міфічна істота, більша за людину, зі шкірою зеленуватого кольору'), " +
            "('пер', 'В Англії та (до революції 1848 р.) у Франції – звання представника вищого прошарку дворянства; особа, яка має це звання'), " +
            "('пук', 'Те саме, що пучок (1. В’язка однорідних предметів 2. Сукупність чого-небудь, що розходиться з однієї точки, з одного джерела)'), " +
            "('пут', 'Опціон, який за певну плату дає право протягом певного часу за домовленою ціною продавати цінності (товар, цінні папери)'), " +
            "('раз', '1. У сполученні з числівником один або без нього означає однократність дії || У сполученні з іншими кількісними числівниками вказує на повторення дії 2. У сполученні з порядковими числівниками, вказівними та означальними займенниками, прикметниками характеризує дію кількісно, вказує на її багатократність 3. Уживається при лічбі в значенні кількісного числівника один'), " +
            "('реп', '1. Декламація, речитативне виконання віршів під ритмічну музику 2. Танець під таку музику'), " +
            "('тен', '1. Електричний нагрівний елемент в електрокамінах, саунах та ін. 2. Те саме, що тетранітропентаеритрит'), " +
            "('ток', 'Потік, струмування рідини'), " +
            "('фрі', 'Спосіб кулінарної обробки – засмажений у великій кількості жиру до утворення рум’яної шкоринки'), " +
            "('яга', 'Казковий персонаж східних і західних слов’ян; зла баба-чаклунка'), " +
            "('абаз', 'У давнину: дрібна срібна монета, що була в обігу в Персії та на Кавказі'), " +
            "('ажан', 'Поліцейський чин у Франції'), " +
            "('азан', 'Заклик до молитви у мусульман, що його муедзин проголошує з мінарету'), " +
            "('акне', 'Загальне позначення захворювань шкіри з утворенням папул і пустул'), " +
            "('алан', '1. Представник племені іранського походження, яке на початку 5 ст. дісталося теренів Галлії, Іспанії та Лузітанії 2. Порода собак, що вирізняється великою головою, широкими грудьми, короткими й дуже сильними лапами, короткою та грубою шерстю, червонастим кольором'), " +
            "('амід', '1. Похідна кислоти, у якої гідроксильна група заміщена аміногрупою 2. Хімічні сполука, що утворюються заміною одного атома Гідрогену амоніаку атомом металу'), " +
            "('анти', 'Назва східнослов’янських племен, які в 4-6 ст. заселяли територію між Дністром і Дніпром'), " +
            "('арго', 'Умовна говірка якого-небудь соціального середовища (групи, гуртка і т. д.), в якій є специфічні слова й вислови, незрозумілі для сторонніх; жаргон'), " +
            "('аура', '1. Гіпотетичне поле, яке створюється живим організмом; біополе 2. Особливий стан, що передує нападам епілепсії, істерії і т. ін. 3. Щипковий язичковий інструмент'), " +
            "('барк', 'Вітрильне судно з кількома щоглами'), " +
            "('бета', 'Друга літера грецької абетки'), " +
            "('біом', 'Сукупність видів рослин і тварин, що складають живе населення даного району'), " +
            "('блік', '1. Відблиск світла; світлова пляма на темному тлі 2. Зливок срібла, що містить 2-7% свинцю (блікове срібло)'), " +
            "('буна', 'Напівзагата – дамба, розміщена перпендикулярно або під деяким кутом до берега моря (річки), регулює режим водяного потоку, захищає берег від розмивання'), " +
            "('ваба', '1. Приваблювання птаха або звіра шляхом звукової імітації 2. Наслідування виття вовка з метою виявити місце, де знаходиться виплід'), " +
            "('віно', 'Плата за наречену в деяких давньоруських племенах'), " +
            "('вкіс', 'Те саме, що укіс (1. Дія за значенням укосити 2. Кількість скошеного хліба, сіна за один раз, за день, за сезон і т. ін. 3. Похила, спадиста поверхня; схил гори, берега; бічна поверхня насипу залізниці, дороги і т. ін.)'), " +
            "('воло', '1. Розширена частина стравоходу в багатьох птахів, де тимчасово перебуває та попередньо перетравлюється їжа 2. Ожиріле підборіддя (в людини) 3. Пухлина щитовидної залози за базедової хвороби'), " +
            "('вона', 'Грошова одиниця Кореї, що дорівнює 100 чонів'), " +
            "('ворс', 'Те саме, що ворса (густий пушок із коротких волокон на поверхні деяких тканин)'), " +
            "('гало', 'Група оптичних явищ в атмосфері, що виникають внаслідок заломлення світла у кристаликах льоду, з яких складаються перисті хмари, тумани'), " +
            "('гета', 'Японські дерев’яні сандалі'), " +
            "('гофр', 'Тонкі металеві, азбоцементні та інші листи зі складчастою, хвилеподібною поверхнею'), " +
            "('грат', 'Зайвий метал, що залишається на крайках виробів після обробки'), " +
            "('дані', '1. Відомості, показники, необхідні для ознайомлення з ким-, чим-небудь, для характеристики когось, чогось або для певних висновків, рішень || Підстави, причини 2. Здібності, якості, необхідні для чого-небудь 3. Тексти, таблиці, інструкції, відомості про факти, явища і т. ін., представлені у буквено-цифровій, числовій, текстовій, звуковій або графічній формі, які зберігаються в ЕОМ та пересилаються і піддаються обробці'), " +
            "('деко', 'Тонкий, щільний шматок або шар якого-небудь матеріалу (паперу, заліза, фанери і т. ін.)'), " +
            "('дзен', 'Різновид буддизму, який своєрідно тлумачить питання про співвідношення земного та божественного світу, стверджуючи, що вони знаходяться в нерозривній єдності між собою'), " +
            "('діва', 'Поетичне звертання до дівчини'), " +
            "('донг', 'Грошова одиниця у В’єтнамі – 10 хао, 100 су'), " +
            "('дорн', '1. Порожній чи суцільний циліндр, на якому провадять збирання, склеювання чи вулканізацію гумових виробів 2. Стрижень із загартованої сталі для прошивання отворів у нагрітому сталевому зливку 3. Оправка з пристосуванням для утримування насадженого предмета'), " +
            "('дрон', 'Безпілотний літальний апарат (БПЛА) військового чи цивільного призначення, різновид військового робота; мобільний, автономний апарат, запрограмований на виконання якихось завдань'), " +
            "('есер', 'Соціаліст-революціонер'), " +
            "('етер', 'Те саме, що ефір (1. Далека височінь, безповітряний простір 2. Повітряний простір, у якому поширюються радіохвилі)'), " +
            "('ехін', 'Частина капітелі колони доричного ордера у вигляді круглої в плані подушки з опуклим криволінійним профілем'), " +
            "('жако', 'Вид птахів ряду папугоподібних, поширений у Західній Африці, здатний до наслідування звуків, зокрема людської мови'), " +
            "('злет', 'Розвиток чого-небудь по висхідній, рух уперед || Поривання'), " +
            "('ідея', '1. Поняття, уявлення, що відбивають дійсність у свідомості людини та виражають ставлення її до навколишнього світу 2. Основний принцип світогляду; переконання 3. Думка про що-небудь, міркування з приводу чогось || Задум, план, намір 4. Основна думка, що визначає зміст твору'), " +
            "('ікло', '1. Зуб між різцями й передкореневими зубами в кожній половині верхньої та нижньої щелеп людини й ссавців 2. Великих розмірів зуб, що виступає з рота назовні (в деяких ссавців): бивень'), " +
            "('імла', 'Повітря, густо насичене водяною парою; туман || Повітря, насичене дрібними пилинками, димом і т. ін.'), " +
            "('інія', 'Ссавець сімейства річкових дельфінів'), " +
            "('інок', 'Одна з назв православного монаха'), " +
            "('ірит', 'Запалення райдужної оболонки ока у людини та багатьох тварин'), " +
            "('капа', '1.  Предмет з гнучкої пластмаси, який одягають на зуби, щоб захистити їх від спортивних травм 2. Плоска крива лінія, що є геометричним місцем точок дотику прямих, проведених з початку координат до кола, центр якого переміщується вздовж осі абсцис'), " +
            "('квак', 'Птах родини чаплевих'), " +
            "('кепі', 'Те саме, що кепка (чоловічий головний убір із м’яким дашком, без твердого денця та околички)'), " +
            "('кілт', '1. Спідниця шотландського горця; національний шотландський костюм 2. Картата спідниця у складку (жіноча або дитяча)'), " +
            "('крап', '1.  Забарвлення у вигляді дрібних цяток на чому-небудь || Дрібні цятки (крапки) на шерсті собаки || Малопомітні умовні позначки на зовнішньому боці гральних карт, що їх роблять шахраї для розпізнавання карт 2. Барвник, якого добувають із коріння фарбувальної марени'), " +
            "('крор', 'Одиниця укрупненого рахунку рупій, застосовувана в ряді країн Південно-Східної Азії (1 крор – 10 млн. рупій)'), " +
            "('куна', '1. Грошова одиниця Хорватії – 100 ліп 2. Збірна назва грошей домонгольської Русі, серед яких були й хутра цінних порід тварин'), " +
            "('курд', 'Представник народу іранської мовної групи, що живе в Ірані, Туреччині, Іраці та деяких інших країнах Близького Сходу і частково на Закавказзі'), " +
            "('лобі', '1. Система контор і агентів монополій при законодавчих органах, що чинять тиск на законодавців і чиновників на користь того або іншого рішення; лобізм || Особи, що справляють вплив на членів парламенту під час прийняття чи відхилення законів тощо 2. Агентура цих контор і агентств; лобісти'), " +
            "('лови', '1. Полювання на звіра, птахів, рибу тощо 2. Те саме, що ловлення (дія за значенням ловити)'), " +
            "('лорі', 'Рід папуг, які добре наслідують звуки людської мови'), " +
            "('лояк', 'Тальк'), " +
            "('луск', 'Те саме, що лускіт (дія за значенням лускати)'), " +
            "('ляск', '1. Те саме, що ляскання 2. Те саме, що лящання'), " +
            "('маго', 'Безхвоста мавпа родини макак'), " +
            "('мапа', 'Карта (умовно зменшене загальне зображення земної поверхні, її частини або окремих країн світу)'), " +
            "('мате', '1. Південноамериканське вічнозелене дерево з ряду падуб родини падубових 2. Напій, що його виготовлюють з сухих листків південноамериканської дерев’янистої рослини тієї самої назви; парагвайський чай'), " +
            "('мило', 'Тверда, напіврідка або рідка речовина – натрійні або калійні солі вищих жирних кислот; розчиняється у воді та вживається для миття і прання || Піна, що утворюється з розчиненням цієї суміші у воді'), " +
            "('миро', 'Ароматна олія, яку його використовують у християнських церковних обрядах'), " +
            "('морф', 'Конкретний лінійний представник морфеми як узагальненої одиниці мови, один з формальних її різновидів, що встановлюється при поділі текстового слова'), " +
            "('нава', 'Те саме, що неф (витягнуте у довжину приміщення (або частина приміщення), відокремлене рядом колон чи стовпів)'), " +
            "('наос', 'На Сході – головне приміщення античного храму, до знаходилось скульптурне зображення божества'), " +
            "('окап', 'Черепиця'), " +
            "('окіл', '1. Навколишня місцевість; околиця (окіл точки — будь-яка відкрита множина, елементом якої є дана точка) 2. Оточення, товариство'), " +
            "('окур', 'Окурювання димом глини перед випалом'), " +
            "('опал', 'Прозорий склоподібний камінь різного забарвлення, деякі різновиди якого вважаються коштовними'), " +
            "('опит', 'Дія за значенням опитувати, опитати'), " +
            "('орар', 'Частина одягу диякона, перев’язь, розшита хрестами, що одягається на ліве плече'), " +
            "('охра', 'Те саме, що вохра (природна мінеральна фарба червоно-брунатного або жовтого кольору)'), " +
            "('пава', '1. Великий південноазіатський птах родини фазанових, самці якого мають яскраве оперення і довгий барвистий хвіст, що розпускається у вигляді віяла 2. Самка павича'), " +
            "('панк', '1. Декласовані молодіжні групи на Заході, які вирізняються підкресленою аполітичністю, шокуючим зовнішнім виглядом, шокуючою поведінкою 2. Член такої групи 3. Стиль молодіжної музики, який вирізняється агресивною манерою виконання, швидким ритмом'), " +
            "('парі', 'Угода про виконання якого-небудь зобов’язання тією особою, що програє'), " +
            "('песо', '1. Старовинна іспанська срібна монета 2. Грошова одиниця Аргентини, Гвінеї-Бісау, Домініканської Республіки, Колумбії, Куби, Мексики, Філіппін, що дорівнює 1/100 сентаво 3. Грошова одиниця Уругваю, Чилі, що дорівнює 1/100 сентесимо'), " +
            "('піта', 'Волокна з листя американської агави'), " +
            "('поза', '1. Положення тіла людини або тварини || Положення, що його спеціально приймає той, кого малюють або фотографують 2. Частина танцювального руху'), " +
            "('птоз', 'Опущення верхньої повіки у людини або тварин внаслідок відсутності, недорозвинення або паралічу м’яза, що її підіймає'), " +
            "('рака', 'Велика кам’яна гробниця для зберігання останків тих, кого християнська церква визнавала святими'), " +
            "('ралі', '1. Спортивне змагання на спеціально підготовлених стандартних автомобілях або мотоциклах за заданим режимом руху 2. Стрімке зростання цін (або ціни окремої акції) після їх попереднього падіння на фондовому ринку'), " +
            "('регі', 'Різновид, стиль рок-музики (який використовує шумові ефекти та елементи народної музики)'), " +
            "('сван', 'Представник етнографічної групи грузинів, що живе в гірській частині Західної Грузії (Сванетії)'), " +
            "('сіда', 'Рід рослин родини мальвових'), " +
            "('соня', 'Невеличка жовтувато-сіра тварина ряду гризунів, що проводить зиму у сплячці'), " +
            "('спин', 'Зупинка, затримка'), " +
            "('стук', 'Те саме, що стуко (штучний мармур із полірованого гіпсу з домішками)'), " +
            "('сура', 'Розділ Корану'), " +
            "('твін', 'Низькосортна шерстяна чи бавовняна одноколірна тканина саржевого переплетення'), " +
            "('тлін', 'Те саме, що тлінь'), " +
            "('трус', 'Ретельний огляд офіційними особами кого-, чого-небудь для виявлення прихованого, недозволеного або вкраденого; обшук'), " +
            "('улан', 'У царській і деяких сучасних арміях – солдат або офіцер легкої кінноти || Кіннотник у металевому шоломі, прикрашеному султаном з кінського хвоста'), " +
            "('упин', 'Зупинка, затримка'), " +
            "('фогт', 'У середньовічній Західній Європі – світська посадова особа у церковній вотчині, наділена судовими, адміністративними та фіскальними функціями'), " +
            "('хора', 'Старовинний молдавський і румунський хороводний танець'), " +
            "('абрек', 'Кавказький вигнанець'), " +
            "('агора', 'У Стародавній Греції – народні збори, а також майдан, де вони відбувались'), " +
            "('аерон', '1. Лікарський препарат, що застосовується за морської та повітряної хвороб 2. Легкий сплав алюмінію з міддю, силіцієм, а іноді й домішкою літію'), " +
            "('аксон', 'Те саме, що неврит (запалення нерва у людини або тварини)'), " +
            "('актин', 'Білок м’язової тканини; бере участь у м’язовому скороченні разом з міозином'), " +
            "('антре', '1. У цирку – поява клоунів на манежі || Комічна сценка з використанням буфонади 2. У балеті – вступна частина розгорнутого па-де-де (па-де-труа), вихід одного або декількох виконавців'), " +
            "('апекс', 'Точка небесної сфери (сузір’я Геркулеса), в напрямі до якої рухається Сонячна система'), " +
            "('аспід', 'Рід отруйних змій'), " +
            "('астат', 'Радіоактивний хімічний елемент (At), який добувають штучно і вживають для лікування зобу'), " +
            "('атман', 'В давньоіндійській ідеалістичній філософії – всепроникне суб’єктивне духовне начало, душа'), " +
            "('ацтек', 'Представник найчисленнішої індіанської народності Мексики'), " +
            "('бадан', 'Рід багаторічних трав’янистих рослин родини ломикаменевих; цінна технічна і лікарська рослина'), " +
            "('бакир', 'Мідний казан'), " +
            "('басет', 'Порода великих собак з короткими лапами, витягнутим тулубом, розвинутою мускулатурою, жорсткою шерстю та довгими вухами'), " +
            "('бівак', 'Зупинка військ для відпочинку або ночівлі в польових умовах || Місце відпочинку або ночівлі військ, туристів та інших груп людей у польових умовах; бівуак'), " +
            "('біонт', 'Індивідуум, який пристосувався в процесі еволюції до життя у певному середовищі'), " +
            "('бурат', 'Машина з ситом, крізь яке просіюють сипкі матеріали'), " +
            "('вагри', 'Плем’я полабських слов’ян, що населяло територію між Балтійським морем, рікою Трнавою і озером Фемарн'), " +
            "('валін', 'Одна з життєво необхідних амінокислот; входить до складу білків'), " +
            "('варна', 'У Стародавній Індії кожна з чотирьох станових груп: брахмани, кшатрії, вайші, шудри'), " +
            "('ватин', 'Трикотажна тканина з рідкою основою, але товстим, густим начосом, яка використовується замість вати для утеплення верхнього одягу'), " +
            "('винар', '1. Власник винної крамниці 2. Виноградар, винороб'), " +
            "('вируб', 'Те саме, що вирубування'), " +
            "('волан', '1. Деталь жіночого одягу – оборка з легкої тканини чи мережива 2. Кулька з оперенням або широким хвилястим ободком для гри в бадмінтон'), " +
            "('волот', 'Те саме, що волоть (суцвіття трав’янистих (іноді кущових) рослин, яке складається з дрібних колосків, що утворюють кетяг)'), " +
            "('вояка', 'Те саме, що вояк (той, хто воює, б’ється з ворогом)'), " +
            "('втома', 'Послаблення сил, викликане напруженою фізичною або розумовою працею, тривалим рухом і т. ін.'), " +
            "('гавіт', 'У вірменській середньовічній архітектурі: притвор храму – усипальниця, місце для молитви та зборів'), " +
            "('геном', 'Сукупність генів в одинарному наборі хромосом даної живої клітини'), " +
            "('гімен', 'Дівоча перетинка, що затуляє піхву'), " +
            "('горно', '1. Проста відкрита піч для нагрівання або плавлення металів || Піч для обпалювання керамічних виробів 2. Частина шахтної печі (доменної, вагранки і т. ін.), над якою згоряє паливо і плавиться метал'), " +
            "('грант', 'Одноразова грошова допомога, стипендія із спеціального фонду для проведення наукових, дослідницьких та інших робіт'), " +
            "('данка', 'Представниця народу, що становить основне населення Данії'), " +
            "('дартс', 'Низка пов’язаних ігор, у яких гравці метають короткі стріли (дротики) у круглу мішень, повішену на стіну'), " +
            "('десть', 'Рахункова одиниця писального паперу'), " +
            "('дожин', 'Завершення жнив'), " +
            "('донка', 'Вудка для ловіння риби з дна водоймища'), " +
            "('дрель', 'Інструмент для свердління отворів у металах, деревині тощо'), " +
            "('еклер', 'Заварне тістечко з кремом усередині'), " +
            "('енець', 'Представник нечисленної народності, яка складає корінне населення півострова Таймир в Росії'), " +
            "('ерато', 'В давньогрецькій міфології – одна з 9 муз, покровителька ліричної поезії.'), " +
            "('етнос', 'Спільнота людей (плем’я, народність, нація), що історично склалася та має соціальну цілісність і оригінальний стереотип поведінки'), " +
            "('жакан', 'Куля особливої конструкції для стрільби з гладкоствольної мисливської рушниці'), " +
            "('жовно', '1. Затверділа хвороблива пухлина у вигляді ґулі на тілі людей, тварин, на рослинах 2. М’яз на вилицях, що випинається зі стисканням щелеп'), " +
            "('зарин', 'Фосфорорганічна сполука, безбарвна рухлива рідина; отруйна речовина нервово-паралітичної дії'), " +
            "('імаго', 'Кінцева стадія розвитку комах || Доросла комаха'), " +
            "('ірмос', 'Жанр візантійської та давньоруської гімнографії, тематика якого пов’язана з біблійними піснями'), " +
            "('казан', 'Металева, переважно округлої форми посудина (з відкритою верхньою частиною) для варіння їжі, кип’ятіння води тощо; котел, чавун'), " +
            "('каліф', 'Те саме, що халіф (титул феодального верховного правителя в ряді мусульманських країн, який поєднував духовну і світську владу)'), " +
            "('карел', 'Представник народу, що становить основне населення Карелії'), " +
            "('карія', 'Рід деревних рослин родини горіхових'), " +
            "('карма', 'В індійських релігійно-філософських системах (буддизмі, брахманізмі та ін.) сукупність усіх добрих і поганих справ, учинених людиною в попередніх існуваннях (життях), що визначає її долю в майбутньому'), " +
            "('кілер', 'Найманий вбивця'), " +
            "('коата', 'Рід широконосих мавп родини капуцинових, поширені у Південній Америці'), " +
            "('ковар', 'Магнітний сплав феруму, з нікелем та кобальтом'), " +
            "('кодек', 'Сукупність кодера і декодера, які працюють у протилежних напрямах передавання в одній апаратурі'), " +
            "('кодер', 'Пристрій, який виконує кодування'), " +
            "('котер', 'Представник частини феодально залежних селян середньовічної Англії'), " +
            "('котик', '1. Морський ссавець із цінним хутром; водиться в північній частині Тихого океану || Хутро цієї тварини 2. Суцвіття верби та деяких інших односім’ядольних рослин'), " +
            "('крота', 'Струнний смичковий музичний інструмент, спершу був щипковим'), " +
            "('крупа', '1. Те саме, що крупи (очищені й подрібнені зерна злакових рослин, що їх використовують як продукт харчування) 2. Те саме, що крупина (окреме зернятко крупів)'), " +
            "('лівак', 'Прибічник украй лівих, радикальних поглядів'), " +
            "('ліпід', 'Група органічних речовин, до яких належать жири і жироподібні речовини'), " +
            "('лопар', 'Стара назва представника народності саамі; лапландці'), " +
            "('лотік', 'Відкритий жолоб для стікання води, зсипання чого-небудь'), " +
            "('манат', 'Грошова одиниця Азербайджану і Туркменистану'), " +
            "('манко', 'У торгових та фінансових справах – недовага товару, недостача в касі'), " +
            "('манта', 'Гігантський рогатий скат, «морський диявол»; різновид акули'), " +
            "('манту', 'Підшкірне введення туберкуліну для ранньої діагностики туберкульозу'), " +
            "('марани', 'У середньовічній Іспанії та Португалії – євреї, які офіційно прийняли християнство'), " +
            "('матір', 'Мати'), " +
            "('митар', 'Збирач мита'), " +
            "('місто', 'Великий населений пункт; адміністративний, промисловий, торговий і культурний центр'), " +
            "('моція', 'Спосіб фіксального словотворення іменників зі значенням жіночої статі від іменників чоловічого роду суфіксальним, рідше флексійним способом'), " +
            "('надир', 'Точка небесної сфери, протилежна зеніту'), " +
            "('накра', 'Давньоруський ударний ритмічний музичний інструмент, що походить від нагари'), " +
            "('нанка', 'Груба бавовняна тканина, переважно жовтого кольору, яка зараз вийшла з ужитку'), " +
            "('нарди', 'Гра, що поширена серед народів Кавказу та Середньої Азії'), " +
            "('нарти', 'Вузькі довгі сани, якими користуються для їзди на оленях та собаках'), " +
            "('натік', 'Шар якої-небудь речовини, що натекла куди-небудь, розтеклася по чомусь'), " +
            "('нерка', 'Риба родини лососей'), " +
            "('нурта', 'Те саме, що вир (місце у річці, морі і т. ін. з круговим рухом води, що утворюється внаслідок дії протилежних течій)'), " +
            "('овіна', 'Гостре вірусне захворювання, збудник якого генетично близький до збудника натуральної віспи людини'), " +
            "('октет', '1. Інструментальний музичний твір для восьми виконавців 2. Ансамбль з восьми виконавців (співаків або музикантів)'), " +
            "('орнат', 'У середньовічному східно-християнському мистецтві – урочистий царський одяг головного персонажа релігійної сцени'), " +
            "('осман', 'Давня назва турка — представника населення Османської імперії'), " +
            "('отоса', '1. Те саме, що отеса (пристрій у возі з залізного прута, дроту або мотузки, яким прикріплюють край голоблі до осі для вирівнювання ходу) 2. Те саме, що ванти (сталеві або прядив’яні канати для кріплення щогл і піднімання по них, згортання і напинання корабельних вітрил)'), " +
            "('падло', 'Те саме, що падаль (труп тварини, трупи тварин)'), " +
            "('парео', 'Одяг у вигляді цільного прямокутного відрізу тканини, що може бути зав’язаний на тілі у різний спосіб, зазвичай, картатого забарвлення'), " +
            "('патіо', 'Внутрішній дворик, часто оточений галереями; поширені в країнах Середземномор’я, Латинської Америки'), " +
            "('перко', 'Рід свердла, що застосовується в столярській справі'), " +
            "('пірке', 'Прищеплювання на шкірі, за допомогою якого встановлюють наявність або відсутність в організмі туберкульозної інфекції'), " +
            "('плеск', 'Те саме, що плескіт (шум від руху, падіння води (або іншої рідини))'), " +
            "('помір', '1. Численне вимирання внаслідок епідемії 2. Вимірювання 3. Торг, мито в Україні, Росії, Білорусі, Литві й Польщі за феодалізму, що його стягували з привізного товару'), " +
            "('помор', 'Представник етнографічної групи росіян, що живе на узбережжі Білого та Баренцового морів'), " +
            "('рекет', 'Злочинне вимагання, яке здійснюється шляхом шантажу, загроз, насильством'), " +
            "('ретро', 'Напрям, стиль, звернений в минуле; захоплення минулим, мода на минуле'), " +
            "('робак', 'Те саме, що черв’як (безхребетна тварина, яка пересувається, вигинаючи своє м’яке видовжене тіло)'), " +
            "('родео', 'Вид спорту, що полягає в умінні протриматися на спині дикого бика, коня, вхопившись рукою за перекинуту через тулуб вірьовку'), " +
            "('ротсе', 'Народ в Замбії'), " +
            "('русин', 'Стара назва представника українського населення Буковини, Галичини, Закарпатської України, Словаччини і Воєводини'), " +
            "('саміт', 'Конференція, нарада, збори глав держав та урядів'), " +
            "('сапка', 'Те саме, що сапа (1. Окоп, траншея, хід сполучення, які риють у напрямі до позицій противника для поступового й непомітного наближення до нього 2. Ручне сільськогосподарське знаряддя для підпушування ґрунту й знищення бур’яну, яке являє собою металеву лопатку, насаджену перпендикулярно на дерев’яний держак)'), " +
            "('свінг', '1. У боксі – боковий удар зі значної віддалі 2. Ритмічний феномен, один із визначальних елементів джазу, у якому ритмічна пульсація характеризується незбіганням акцентів мелодичної та ритмічної ліній 3. Джазовий стиль, характерною особливістю якого є сольна імпровізація, складний акомпанемент, великий склад виконавців 4. Межа взаємного кредитування підприємствами, банками яких-небудь фінансових об’єктів, міжгосподарських зв’язків, розрахунків 5. Коливання курсу цінних паперів і валюти, а також біржових цін на товари 6. У США – кредитна лінія, що відкривається банками для своїх клієнтів 7. Кредит у формі проміжної позики, що надається для купівлі майна на термін, поки позичальник не продасть інше майно; кредит-пост'), " +
            "('серин', 'Одна з найпоширеніших природних амінокислот; входить до складу майже всіх білків'), " +
            "('сонар', '1. Прилад гідроакустичної локації для визначення на відстані місцеположення об’єктів, що знаходяться у воді; гідролокатор 2. Особливий орган водних тварин, що дозволяє їм виявляти об’єкти на відстані'), " +
            "('стала', 'Незмінна, постійна фізична величина, константа'), " +
            "('табес', '1. Прогресивне виснаження, знесилення 2. Хронічне захворювання нервової системи, пізній прояв сифілісу'), " +
            "('таліб', 'В Афганістані – учень релігійних навчальних закладів (медресе), ісламський фундаменталіст'), " +
            "('танка', '1. Жанр японської поезії 2. У тибетському образотворчому мистецтві – зображення, переважно релігійного змісту, виконане клейовими фарбами або відбите на шовку чи бавовняній тканині'), " +
            "('тарко', 'Рябий пес'), " +
            "('тепло', '1. Те саме, що теплота 2. Нагрів кого-, чого-небудь; підвищена температура чогось || Нагріте повітря, що йде від когось, чогось || Порівняно висока температура повітря де-небудь || Тепле повітря, що поширюється від чогось нагрітого, гарячого || Температура повітря вище нуля || Про відчуття внутрішньої теплоти 3. Тепла пора року; тепла погода'), " +
            "('тикар', 'Народ в Камеруні'), " +
            "('тимар', 'Дрібне феодальне земельне володіння в Османській імперії'), " +
            "('тіпун', 'Хвороба птахів – хрящуватий наріст на кінчику язика'), " +
            "('толос', 'Монументальна, кругла у плані будівля (гробниця, храм) в егейській культурі і античному світі'), " +
            "('тонер', 'Барвна речовина для друку на світлокопіювальному апараті'), " +
            "('траст', '1. Довірче управління, угода на передачу власності якій-небудь особі, яка управляє нею на користь іншій особі 2. Тип стосунків між клієнтом і фінансовою організацією, фірмою щодо охорони і захисту інтересів клієнта 3. Різновид банківської організації, що оперує вкладами клієнтів, сплачуючи їм відсотки від отриманих прибутків'), " +
            "('трона', 'Мінерал класу карбонатів; сировина для одержання соди'), " +
            "('турка', 'Невелика металева посудина з довгою ручкою для приготування кави'), " +
            "('хазар', 'Представник тюркомовного кочового народу, який з’явився у Східній Європі у 4 ст.'), " +
            "('хакер', 'Комп’ютерний хуліган, який проникає в чужі інформаційні системи'), " +
            "('цурка', '1. Короткий обрубок дерева; цурпалок || Тріска, скалка 2. Невеличка, загострена з одного боку паличка, за допомогою якої в’яжуть снопи, туго скручуючи перевесла 3. Маленька паличка, яку в селянському одязі використовують як ґудзик 4. Кругла, загострена з двох боків дерев’яна паличка для дитячої гри'), " +
            "('амідол', 'Органічна сполука, що її застосовують у фотографії як проявник'), " +
            "('аронія', 'Чорноплідна горобина'), " +
            "('афонія', 'Втрата голосу, беззвучність його (внаслідок захворювання гортані або ураження нервової системи)'), " +
            "('біоцид', 'Знищення усіх форм життя'), " +
            "('борніт', 'Строката мідна руда – мінерал класу сульфідів'), " +
            "('бревіс', 'Один із нотних знаків мензуральної нотації, що дорівнює двом цілим (подвійна ціла нота)'), " +
            "('брунат', 'Коричневий, каштановий колір'), " +
            "('відтин', 'Дія та її результат за значенням відтинати, відітнути || Місце, у якому відітнуто що-небудь'), " +
            "('вістка', 'Те саме, що звістка (повідомлення, вість про кого-, що-небудь)'), " +
            "('віянка', '1. Провіювання зерна 2. Провіяне зерно'), " +
            "('гарсон', 'У Франції – офіціант ресторану чи кафе'), " +
            "('гліома', 'Пухлина, що розвивається в головному, рідше у спинному, мозку'), " +
            "('голіаф', '1. Безхвоста земноводна тварина родини жаб 2. Великий жук родини пластинчатовусих, поширений у Центральній Африці'), " +
            "('діарея', 'Розлад діяльності кишечнику у людини й тварин'), " +
            "('істота', 'Живий організм, людина, тварина'), " +
            "('кантрі', 'Музичний стиль, в основі якого лежать народні мелодії (поширений основному у США) || Народний стиль одягу'), " +
            "('канцер', 'Злоякісна пухлина; рак'), " +
            "('карнет', 'Митний дозвіл на перевезення вантажу через кордон автомобільним транспортом за мінімальних формальностей'), " +
            "('клуатр', 'Крита галерея, що обрамляє прямокутний двір монастиря або великої церкви у романській та готичній архітектурі'), " +
            "('костел', 'Римсько-католицький храм'), " +
            "('кратон', 'Консолідована ділянка континентальної земної кори, що не зазнає значних складчастих деформацій'), " +
            "('ланіта', 'Щока'), " +
            "('листок', '1. Те саме, що лист 2. Те саме, що листівка (друкований або рукописний листок із злободенним, агітаційним змістом)'), " +
            "('лобіст', 'Особа, що знаходиться на службі якої-небудь великої монополії, за допомогою якої здійснюється тиск на законодавців і державних чиновників в інтересах цієї компанії'), " +
            "('макрос', 'Набір інструкцій, програма, які інтерпретуються прикладною програмою або системою для автоматизації яких-небудь дій'), " +
            "('мантра', 'Магічна формула викликання і закликання богів у давньоіндійській традиції'), " +
            "('марита', 'Статевозріла стадія деяких трематод, які паразитують в організмі остаточного господаря'), " +
            "('мартин', 'Водоплавний птах родини мартинових, що живиться рибою, комахами та дрібними гризунами'), " +
            "('надрив', 'Надірване місце || Часткове порушення неперервності м’яких тканин при закритих пошкодженнях'), " +
            "('наклад', 'Загальна кількість примірників видання однієї назви; тираж'), " +
            "('нестор', 'Птах ряду папуг'), " +
            "('океніт', 'Рідкісний мінерал; білі гнучкі плоскі кристали або волокнисті маси з жовтуватим чи блакитним відтінками'), " +
            "('оладка', 'Те саме, що оладок (невеликий товстий млинець)'), " +
            "('оперон', 'Одиниця зчитування генетичної інформації, що є сукупністю розташованих у лінійній послідовності структурних генів і гена-оператора'), " +
            "('оптрон', 'Елемент, що складається з джерела оптичного випромінювання та фотоприймача'), " +
            "('плотер', 'Пристрій в ЕОМ, який виводить інформацію у вигляді графіків'), " +
            "('понтер', 'Гравець, який робить ставку проти банку; той, хто грає проти банкомета'), " +
            "('постер', 'Рекламний засіб у вигляді плаката, оголошення, афіші'), " +
            "('протік', 'Те саме, що протока (річка або струмок, що з’єднує дві водойми)'), " +
            "('ратник', 'У дореволюційній Росії – рядовий державного ополчення'), " +
            "('ремікс', 'Новий варіант, переробка старої мелодії, пісні і т. ін.'), " +
            "('саронг', 'Чоловічий і жіночий одяг народів Індонезії і сингальців Шрі-Ланки'), " +
            "('сванка', 'Представниця етнографічної групи грузинів, що живе в гірській частині Західної Грузії (Сванетії)'), " +
            "('свитка', 'Те саме, що свита (старовинний довгополий верхній одяг, звичайно з домотканого грубого сукна)'), " +
            "('смоква', 'Те саме, що смоківниця (плодове субтропічне дерево роду фікус родини шовковичних)'), " +
            "('ставок', 'Те саме, що став (водоймище (у природному чи штучному заглибленні) з непроточною водою)'), " +
            "('таксон', 'Класифікаційна одиниця в систематиці рослинних і тваринних організмів'), " +
            "('танбур', 'Таджицький та узбецький народний струнний щипковий музичний інструмент, подібний до лютні'), " +
            "('тантра', 'В індуїзмі та буддизмі – дія, що супроводжує культовий обряд'), " +
            "('текіла', 'Мексиканська горілка з агави'), " +
            "('тіофен', 'Гетероциклічна сполука, похідні якої застосовують як лікарські препарати, стимулятори росту, гербіциди тощо'), " +
            "('токата', 'Віртуозна музична п’єса для фортепіано чи органа, витримана у швидкому, чітко ритмованому безперервному русі'), " +
            "('тоніка', '1. Головний, основний тон, звук ладу, до якого тяжіє решта звуків ладу 2. Основний акорд ладу (мажорний або мінорний тризвук), який побудований на I ступені ладу'), " +
            "('трафік', 'Інтенсивність потоку повідомлень у мережі передачі даних'), " +
            "('тропан', 'Алкалоїд, якого в природі не існує, але він є родоначальником ряду алкалоїдів (кокаїну, атропіну тощо)'), " +
            "('автонім', '1. Ім’я, символ або знак, що їх використовують для позначення самих себе 2. Справжнє ім’я автора твору, на відміну від псевдоніма'), " +
            "('акреція', '1. Падіння речовини на зорю (галактику або інше космічне тіло) з навколишнього простору 2. У міжнародному праві – природнє прирощення території держави нещодавно утвореними суходільними ділянками'), " +
            "('антиква', 'Шрифт із заокругленими контурами на відміну від готичного, який має кутасту форму'), " +
            "('батоліт', 'Форма залягання глибинних магматичних гірських порід'), " +
            "('білотка', 'Багаторічна гірська трав’яниста рослина родини складноцвітих, густо вкрита білими волосками; суцвіття її квіток схожі на білі зірки; едельвейс'), " +
            "('біотест', 'Біологічний об’єкт із відомими властивостями, що його використовують для дослідження невідомих біологічних об’єктів'), " +
            "('китолов', 'Те саме, що китобій (той, хто займається промислом китів)'), " +
            "('кластер', '1. Абстрактний тип даних 2. Підмножина об’єктів із певними наборами ознак, які виявляються за кластерного аналізу 3. Співзвуччя, утворене малими або великими секундами 4. Система з великої кількості слабо пов’язаних атомів або молекул'), " +
            "('манірка', 'Похідна металева фляжка з кришкою у вигляді склянки, що загвинчується'), " +
            "('мінорат', '1. Порядок спадкування, коли майно передається молодшому за віком у роді або сім’ї; протилежне майорат 2. Саме майно, що передається за міноратом'), " +
            "('невтома', 'Те саме, що невтомність'), " +
            "('пароніт', 'Листовий матеріал, що виготовляється пресуванням маси, що складається з азбесту, каучуку та порошкових інгредієнтів'), " +
            "('селіток', 'Який народився поточного року'), " +
            "('сентаво', 'Розмінна монета Аргентини, Болівії, Бразилії, Гватемали, Гвінеї-Бісау, Домініканської Республіки, Колумбії, Куби, Мексики, Філіппін, Гондурасу, Еквадору, Кабо-Верде, Португалії, Мозамбіку, Нікарагуа, Перу, Сан-Томе і Принсіпі'), " +
            "('стакато', 'Уривчасте виконання звуків, при якому вони чітко відокремлюються один від одного; протилежне легато'), " +
            "('харизма', '1. Виняткова обдарованість (про святих) 2. Високий авторитет, який базується на вмінні підкоряти інших своїй волі'), " +
            "('манок', '1. Статки, майно 2. Пищик, що імітує голос певного виду птаха або звіра 3. Підсадка качка, гуска та ін.'), " +
            "('кола', 'Рід вічнозелених дерев родини стеркулієвих'), " +
            "('базука', 'Легка протитанкова безвідкатна гармата'), " +
            "('крек', 'Сильнодіючий наркотик, отриманий синтетичним способом'), " +
            "('бод', 'Одиниця швидкості передавання інформації; 1 бод відповідає 1 біту за секунду'), " +
            "('азу', 'Страва з дрібно нарізаних шматочків м’яса в гострому соусі'), " +
            "('бат', 'Грошова одиниця Таїланду, що дорівнює 100 сантангів'), " +
            "('кіп', 'Грошова одиниця Лаосу'), " +
            "('чон', 'Розмінна монета КНДР і Південної Кореї'), " +
            "('вату', 'Грошова одиниця Вануату, що дорівнює 100 сантимів'), " +
            "('драм', 'Грошова одиниця Вірменії – 100 лумів'), " +
            "('кіна', 'Грошова одиниця Папуа-Нової Гвінеї – 100 тойя'), " +
            "('кляр', 'Рідке тісто, яким покривають продукти перед обсмажуванням'), " +
            "('ларі', '1. Грошова одиниця Грузії 2. Розмінна монета Мальдівів'), " +
            "('лате', 'Напій із кави еспресо та молока'), " +
            "('лоті', 'Грошова одиниця Лесото, що дорівнює 100 лісенте'), " +
            "('пула', 'Грошова одиниця Ботсвани'), " +
            "('ріал', '1. Грошова одиниця Ємену – 100 філсів 2. Грошова одиниця Ірану – 100 динарів 3. Грошова одиниця Оману – 1000 байзів'), " +
            "('табі', 'Матерчаті японські шкарпетки'), " +
            "('така', 'Грошова одиниця Бангладеш'), " +
            "('тала', '1. Грошова одиниця Західного Самоа 2. Принцип метроритмічної організації індійської класичної музики'), " +
            "('віна', 'Індійський семиструнний щипковий музичний інструмент'), " +
            "('епод', 'В античному віршуванні – ліричний вірш, в якому довгі рядки чергуються з короткими'), " +
            "('каді', 'Духовна особа в мусульман, яка здійснює судочинство на основі мусульманського права (шаріату) і місцевого звичаєвого права (адату)'), " +
            "('своп', '1. Тимчасова купівля з гарантією подальшого продажу 2. Продаж одного цінного паперу і купівля іншого з більш тривалим терміном погашення 3. Операція з обміну національної валюти на іноземну із зобов’язанням зворотного обміну через певний строк 4. Продаж наявної валюти (спот) з одначасною купівлею на термін (форвард) або навпаки 5. Різниця у процентних ставках по двом валютам на той самий термін'), " +
            "('тетрі', 'Розмінна монета Грузії – 1/100 ларі'), " +
            "('тіні', 'Спресована пудра різних відтінків, що використовується для декоративної косметики'), " +
            "('аніме', 'Японська анімація, що орієнтується не на дитячу, а переважно підліткову чи навіть дорослу аудиторію'), " +
            "('долма', 'Голубці з виноградного листя'), " +
            "('панти', 'Молоді, ще м’які, покриті шерстю роги плямистого або звичайного оленів (марала та ізюбра), які використовуються для виготовлення лікувальних препаратів'), " +
            "('карибу', 'Загальна назва кількох видів дикого північного оленя'), " +
            "('мартіні', 'Коктейль із сухого білого вермуту і джину або горілки з лимонною цедрою та оливками'), " +
            "('тороки', '1. Ремені ззаду сідла для прив’язування речей або прив’язаний до сідла дорожній мішок 2. Погони з металевими або шкіряними петлями для ношення добутих зайців; ремені для ношення добутих качок та ін. птахів'), " +
            "('нетто', '1. Вага товару без тари і упаковки 2. Ціна товару за вирахуванням знижок 3. Чистий прибуток або дохід бюджету після вирахування витрат'), " +
            "('ксерокс', 'Апарат, за допомогою якого здійснюється копіювання методом ксерографії'), " +
            "('піар', 'Особливий вид діяльності, спрямований на формування громадської думки з широкого спектра питань (політична акція, виборча кампанія, бізнес, виробництво, благодійність, реклама і т. ін.)'), " +
            "('мураха', 'Те саме, що мурашка (невелика комаха ряду перетинчастокрилих, що живе у великих колоніях)')";

        DB.insertComposingWords(newComposingWords).then(function () {
          DB.insertWordsDescriptions(newWordsDescriptions).then(function () {
          }, function (err) {
            console.error(err);
          });
        }, function (err) {
          console.error(err);
        });
      }
    };
  })
